#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>



//      //函数的递归 （主要思考方式：大事化小）

//int main()
//{
//	printf("hehe");
//	main();
//	return 0;
//}     //上为一个简单的函数递归，但会导致栈溢出(Stack overflow)


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////  !!!!!!  函数递归的例子： 分别打印一个整形整数的每一位
////   递归递归，有递有归， 执行时一层层地推进，每一层执行完后也必须一层层的返回倒上一层
////  !!!!!!递归的两个必要条件：  
////  1. 递归是有限制条件的，当满足这个限制条件的时候，递归便不再继续。
////  2. 每次递归调用后越来越接近这个限制条件
////  !!两个条件缺一不可，缺少任意一个就会陷入死循环
//  另需要注意：递归太深也会导致栈溢出

//void print (unsigned int n)
//{
//	if (n > 9)
//	{
//		print(n / 10);
//	}
//	printf ("%d ", n % 10);
//}
//
//int main()
//{
//	unsigned int num = 0;    //unsigned int 是指无符号整形，通常默认为整数
//	scanf("%u", &num);        //%u对应无符号整数
//	print (num);  //打印函数
//	return 0;
//}



/*////// !!! 内存分为三个区   栈区  、  堆区  、  静态区
 栈区：   存放 局部变量、 函数形参   （等临时存储的东西）
 堆区：   存放 动态内存分配的 malloc/free  calloc  realloc
 静态区： 存放 全局变量、 静态变量
*/


//计算1-100中带9的整数中含有9的个数程序
//int main()
//{
//	int i = 0, res = 0;
//	for (i = 1; i <= 100; i++)
//	{
//		if ((i / 10) == 9)
//			res++;
//		if ((i % 10) == 9)
//			res++;
//	}
//	printf("共%d个", res);
//	return 0;
//}



//计算1/1-1/2+1/3-1/4+1/5......+1/99-1/100的结果
//int main()
//{
//	int i = 0;
//	double sum = 0.0;
//	int a = 1;
//	for (i = 1; i <= 100; i++)
//	{
//		sum += a*(1.0 / i);
//		a = -a;
//	}
//	printf("%lf", sum);
//	return 0;
//}



////求十个整数中的最大值
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,11,8,9,10 };
//	int max = 1;
//	int i;
//	for (i = 0; i < 10; i++)
//	{
//		if (arr[i] > max)
//			max = arr[i];
//
//	}
//	printf("%d", max);
//	return 0;
//}



//在屏幕上打印任意行列的乘法表
//int main()
//{
//	printf("几行几列？\n");
//	int a;
//	scanf("%d", &a);
//	int i = 1, j = 1;
//	for (i =1 ; i <= a; i++)
//	{
//		for (j = 1; j <= i; j++)
//		{
//			printf("%d * %d = %d  ", i, j, i * j);
//		}
//		printf("\n");
//	}
//	return 0;
// }


